// За итерация на масив в JS имам три оснивни loop-a (for-of -обикаля индексите) (for-in) (обикновен фор)
// В JS масивите реално са обекти които се държат като масиви. Реално с [-1] ми е като пропърти в обекта -1
// Може да използвам push() и ми добавя дай отзад в масива/ pop() маха и ми връща ел. най отзад
// Зс добавяне/премахване в предната част на масива  shift()/unshift()
// Съединяване на 2 или повече масива с concat();
// Връща елементи от масива sliсe( .. , ..) начален индекс и краен индекс // splice( .. , //)
// indexOf() / includes()  / array.join('-') 

//1. First and Last K Numbers
function firstAndLastNumbers(arr1){
  
}